#ifndef TESTS_H
#define TESTS_H
/// Код коллекции тестовых игро-объектов находится в папке "collection".
///----------------------------------------------------------------------------|
/// "tests.h"
///----------------------------------------------------------------------------:

///---------------------------------|
/// Часы.                           |
///---------------------------------:
#include "collection/Test_Clock_01.h"

///---------------------------------|
/// Сетка                           |
///---------------------------------:
#include "collection/Test_Cell_01.h"

#endif // TESTS_H
