/// #define SFML_STATIC /// ищи в настройках проекта ...
///----------------------------------------------------------------------------|
/// Bloxa [version:2023.11.06]
/// отключить консольное окно: -mwindows
///----------------------------------------------------------------------------:
#include "render/render.h"


///----------------------------------------------------------------------------|
/// Start.
///----------------------------------------------------------------------------:
int main()
{
    setlocale(0, "");

    std::wcout << L"ВЕСЬ ДЕБАГ МОЖНО ТУТ(В КОНСОЛЕ) ...\n\n";

    ///----------------------------------------|
    /// Загрузка глобальных переменных.        |
    ///----------------------------------------:
    Global::init();

    ///----------------------------------------|
    /// Рендер для задач.                      |
    ///----------------------------------------:
    std::unique_ptr<Render>  render(new Render);

    ///----------------------------------------|
    /// Задача Часы.                           |
    ///----------------------------------------:
    obj::Test_Clock_01 clock(render->get(cam::eCAMERA::E_GAME));

    obj::Test_Axis_01  axis (render->get(cam::eCAMERA::E_RED ));
    obj::Test_Cell_01  cell (render->get(cam::eCAMERA::E_RED ));

    ///----------------------------------------|
    /// Задача Тестим Шейдеры.                 |
    ///----------------------------------------:
    obj::IObject* go_shaders =
        Test_Shaders_01::create(render->get(cam::eCAMERA::E_GAME));

    ///----------------------------------------|
    /// Добавляем задачи на рендер.            |
    ///----------------------------------------:
                             render->add    (go_shaders);
                           //render->add    (&clock);

                             render->add2red(&cell );
                             render->add2red(&axis );

    ///----------------------------------------|
    /// Консоль тоже может быть полезна...     |
    ///----------------------------------------:
    Global::info();

    ///----------------------------------------|
    /// Запус рендера. Тут Главный цикл.       |
    ///----------------------------------------:
                             render->run();

    ///----------------------------------------|
    /// Очищаем память.                        |
    ///----------------------------------------:
    Global::del ();
}
